const IDEAS = {
  colleagues: {
    funny: {
      min: {
        what: {
          title: 'Стикеры для рабочего чата',
          text: 'Даже не самые смешные фразы коллег могут заиграть новыми красками в формате стикеров. Современные сервисы облегчили нам задачу: теперь их можно сделать в несколько простых действий.'
        },
        how: {
          text: 'Прошерстите переписки на предмет забавных фраз и сделайте скриншоты. Если не хотите создавать стикеры вручную, воспользуйтесь специальными приложениями (например, Sticker Maker). Загрузите картинки, а оно само создаст набор. Вуаля, теперь вы самый смешной человек на работе!'
        }
      },
      max: {
        what: {
          title: 'Офисные мемы',
          text: 'Превратите смешные рабочие ситуации в мемы, чтобы использовать в самые подходящие (или совсем неподходящие) моменты. Можно даже сделать адвент-календарь и отправлять коллегам поднимающие настроение картинки каждый день до конца декабря.'
        },
        how: {
          text: 'Вам поможет простой редактор, например Bazaart. Найдите подходящую картинку и напишите узнаваемый для коллег текст. Бонус: в картинку можно вставить лицо коллеги — самостоятельно или с помощью нейросети типа TurboText. Будет веселее, мы проверили.'
        }
      }
    },
    inspiring: {
      min: {
        what: {
          title: 'Рабочий нейрогороскоп',
          text: 'Сгенерируйте коллегам предсказания на следующий год. Если звёзды напророчат кому-то новые возможности, добавьте в послание промокод от Яндекс Практикума. Так ваш праздничный прогноз превратится в новые навыки или даже целую профессию. '
        },
        how: {
          text: 'Расскажите YandexGPT о коллегах и попросите её написать новогодние поздравления в стиле гороскопа. Чтобы предсказания получились интереснее, задайте в промте роль для нейросети (например, «представь, что ты астролог с десятилетним стажем») и добавьте побольше деталей.'
        }
      },
      max: {
        what: {
          title: 'Церемония «Коллега года»',
          text: 'Сделайте презентацию с итогами года и почётными грамотами для каждого. Если в офис по сугробам добираться никто не хочет, церемонию можно провести онлайн и отправить курьера. Закажите доставку от Яндекс Go прямо перед звонком, чтобы грамоты приезжали коллегам во время встречи.'
        },
        how: {
          text: 'Расскажите факты о коллегах YandexGPT — она поможет составить текст. Необязательно вспоминать серьёзные достижения: подойдёт самое большое количество шуток или съеденных печений. Презентацию может сгенерировать сервис Presentsimple. Загрузите документ с информацией: нейросеть подберёт дизайн и картинки, а вы отредактируете слайды так, как вам нравится.'
        }
      }
    },
    useful: {
      min: {
        what: {
          title: 'Напоминалка для рабочего чата',
          text: 'Иногда в потоке задач коллеги забывают не только поздравить друг друга с днём рождения, но и пообедать вовремя. Позаботьтесь о них и добавьте в рабочий чат бота, который напомнит о важном.'
        },
        how: {
          text: 'В телеграме, например, в чат можно пригласить бота Skeddy. Чтобы он напоминал о важных делах, настройте сообщения: укажите, как часто и о чём он должен писать. А если кто-то настойчиво забывает пообедать, приложите к сообщению промокод на первый заказ в Яндекс Лавке. Сервис быстро привезёт готовый обед и даже горячий кофе с десертом.'
        }
      },
      max: {
        what: {
          title: 'Новогодний диджитал-уголок',
          text: 'Если на работе не хватает праздничного настроения, создайте его сами. Опросите коллег и соберите в одном месте поздравления, идеи досуга для каникул, подборку новогодних фильмов или рецептов. Не забудьте поставить и украсить диджитал-ёлку.'
        },
        how: {
          text: 'Используйте интерактивную онлайн-доску, например Яндекс Концепт. Откройте доступ к редактированию, чтобы коллеги могли добавить что-то от себя. Вот идея для каникул от нас: когда надоест пересматривать «Иронию судьбы», можно пройти бесплатные курсы от Яндекс Практикума и вернуться на работу с новыми навыками.'
        }
      }
    }
  },
  partner: {
    funny: {
      min: {
        what: {
          title: 'Нейробаллады о любви',
          text: 'Вы когда-нибудь посвящали кому-то песни? Самое время это сделать — ведь сейчас можно не горланить романсы под окном второй половинки, а обойтись более современными решениями.'
        },
        how: {
          text: 'Зарифмуйте текст про партнёра с помощью YandexGPT, а потом загрузите его в генератор Suno. Поэкспериментируйте с жанрами: может, вашей пассии больше понравится баллада в стиле пост-панк или джаз?'
        }
      },
      max: {
        what: {
          title: 'Рандомайзер подарков',
          text: 'Нейросеть + маркетплейсы = оригинальный и неожиданный подарок для тех, у кого закончились идеи. Путешествовать по каталогу самому не надо, дайте YandexGPT сгенерировать артикул.'
        },
        how: {
          text: 'Обговорите бюджет заранее и попросите нейросеть сгенерировать рандомное число (стоит заранее посмотреть, как выглядят артикулы на вашем любимом маркетплейсе). Вбейте это число в поиск по каталогу и посмотрите, что достанется вам или вашему партнёру. Если укладывается в бюджет — заказывайте.'
        }
      }
    },
    inspiring: {
      min: {
        what: {
          title: 'Киновечер воспоминаний',
          text: 'Соберите подборку фильмов, значимых для вашей пары. Например, фильм, на который вы впервые вместе сходили в кино или который дольше всего обсуждали. Пригласите партнёра на диванное свидание и устройте ностальгический киномарафон.'
        },
        how: {
          text: 'Оформите фильмы в презентацию. После тёплых разговоров можно что-то и пересмотреть — из списка, который у вас получился. Чтобы создать киноатмосферу, закажите в Яндекс Лавке попкорн с разными вкусами, сладкую газировку и другие снеки под любимые фильмы.'
        }
      },
      max: {
        what: {
          title: 'Аудиогид по вашим местам',
          text: 'Пригласите партнёра на прогулку, а потом предложите наушник, в котором вместо обычной экскурсии будет ваша история. Когда замёрзнете, загляните в раздел «Куда сходить» от Яндекс Еды — он поможет найти поблизости хорошее место с горячим глинтвейном или вкусной едой. Возможно, оно станет ещё одной точкой для вашего следующего маршрута.'
        },
        how: {
          text: 'Составьте маршрут по значимым для вас местам (например, кафе, где прошло первое свидание). К каждой точке напишите небольшой текст, который начинается как аудиоэкскурсия о месте или здании, но продолжается историей о вас. Наговорите всё это на диктофон или сделайте озвучку с помощью нейросети (например, Robivox или Murf), чтобы сохранить эффект неожиданности.'
        }
      }
    },
    useful: {
      min: {
        what: {
          title: 'Маршрут для следующего путешествия',
          text: 'Составьте план вашего совместного приключения с помощью нейросети. Она сможет учесть интересы обоих, предложить небанальные достопримечательности, рассчитать бюджет и посоветовать, как удобнее всего добраться до нужных мест.'
        },
        how: {
          text: 'Соберите все пожелания в промт и отдайте, например, YandexGPT — пусть думает. Чтобы побольше ходить, но успеть хорошенько полежать, чтобы к морю, но чтобы и горы тоже были, чтобы посетить все достопримечательности, но не забыть и про рестораны, и всё это за выходные... Удачи тебе, дорогая нейросеть!'
        }
      },
      max: {
        what: {
          title: 'Генератор ужинов',
          text: 'Со временем вопрос «что приготовить на ужин» может вызывать не вдохновение, а усталость. Обратитесь к нейросетям: они помогут составить меню как в ресторане, только с теми блюдами, которые нравятся вам обоим. А если готовить совсем не хочется, всегда можно заказать Яндекс Еду — там найдётся кухня на любой вкус и настроение.'
        },
        how: {
          text: 'Расскажите YandexGPT про предпочтения вашей пары, а она соберёт подходящие рецепты. Можете попросить разделить их на группы по настроению (например, «Быстро приготовить», «Попробовать новое», «Любимая классика»), чтобы получилось настоящее меню. В день Х вам останется только определиться с пожеланиями и выбрать понравившееся блюдо.'
        }
      }
    }
  },
  family: {
    funny: {
      min: {
        what: {
          title: 'Набор открыток на весь год',
          text: 'От потока открыток хочется отключить уведомления в семейном чате? Пора задать тон этому флешмобу! Сгенерируйте свои поздравительные картинки с отсылками на интересы родных. И посмеётесь, и покажете, что неплохо знаете свою семью.'
        },
        how: {
          text: 'Изображения удобно генерировать в Шедевруме и подобных нейросетях, а потом отдельно добавить текст. Открытку можно сделать в определённом стиле — не скупитесь на детали в описании. Получится и поздравление для сестры в стиле известного комикса, и открытка с огромным сомом для дедушки-рыбака. Главное, не перепутать.'
        }
      },
      max: {
        what: {
          title: 'Заставки для телефона',
          text: 'Помните школьные фотографии из двухтысячных, где детей переодевали в пиратов и мушкетёров? Вдохновимся работами мастеров: придумайте для вашей семьи забавное амплуа, найдите общее фото и сделайте из него обои на телефон.'
        },
        how: {
          text: 'Faceswapper.AI вам в помощь! Если не получается придумать, в каком образе представить родных, в базе есть много шаблонов. Персонажи «Звёздных войн»? Мафиозный клан? Футбольная команда? Выбор за вами.'
        }
      }
    },
    inspiring: {
      min: {
        what: {
          title: 'Семейное онлайн-чаепитие',
          text: 'Выведите звонки семье на новый уровень. Пряничный домик к чаю или пачку конфет из детства быстро привезёт Яндекс Лавка. Даже сидя по разные стороны экрана, можно стать ближе, уплетая карамель и вспоминая, как бабушка накладывала вам конфеты в карманы втайне от родителей.'
        },
        how: {
          text: 'Выберите удобное всем приложение и организуйте видеозвонок. А если вы живёте рядом, то есть другой вариант: помогите бабушке с дедушкой выйти на связь с дальними родственниками, которых они давно не видели.'
        }
      },
      max: {
        what: {
          title: 'Книга семейных рецептов',
          text: 'Узнайте секреты приготовления бабушкиных пирожков, маминых котлет и фирменной дедушкиной ухи. Дополните их семейными историями — и получится памятная книга. Можно сразу вместе опробовать рецепты. Чтобы не тратить время на магазины, закажите все ингредиенты в Яндекс Еде.'
        },
        how: {
          text: 'Тёплые иллюстрации для рецептов можно сгенерировать в Шедевруме или других нейросетях. Дальше можете загрузить это всё в презентацию и сохранить в формате PDF, чтобы вся семья могла открыть «книгу» с телефона. Или пойти дальше — и обратиться в настоящую типографию.'
        }
      }
    },
    useful: {
      min: {
        what: {
          title: 'Реставрация старых фотографий',
          text: 'Сделайте чёрно-белые архивные снимки вашей семьи цветными и соберите их в альбом — чтобы листать его за вечерним чаем и спорить, у кого же всё-таки прадедушкины глаза.'
        },
        how: {
          text: 'Сервисов, которые покрасят чёрно-белые фото, много — выбирайте на свой вкус. Есть, например, ИИ-редакторы Hotspot и Neural.love. С первого раза может получиться неидеально — пригодится капелька терпения, как и в любых семейных делах.'
        }
      },
      max: {
        what: {
          title: 'Урок цифровой грамотности',
          text: 'Научите семью пользоваться приложениями, которые облегчат им жизнь. Составьте памятку для родителей, как оплачивать ЖКХ по QR-коду, а для бабушки с дедушкой — как заказывать лекарства или продукты онлайн. '
        },
        how: {
          text: 'Подумайте, что пригодится вашим близким. Может, бабушке не нужен онлайн-банк, но поможет приложение со скидками на продукты? Соберите пошаговый гайд со скриншотами. А ещё его можно распечатать и провести «живой урок» — ещё одна идея совместного времяпрепровождения.'
        }
      }
    }
  },
  friends: {
    funny: {
      min: {
        what: {
          title: 'Инструкция по эксплуатации друга',
          text: 'У вас есть друг, который никогда не берёт трубку? Или не любит пиццу с ананасами? Напишите к нему инструкцию — облегчите жизнь себе и другим. А заодно сделаете первый подарок, который можно и нужно передаривать.'
        },
        how: {
          'text': 'Вспомните особенности друга, загрузите их в YandexGPT и попросите нейросеть написать текст в стиле, к примеру, инструкции к стиральной машинке. Добавьте иллюстрации, где ваш друг изображён в виде схемы. Это можно сделать с помощью нейросети или вручную — в простом редакторе типа Bazaart.'
        }
      },
      max: {
        what: {
          title: 'Выдуманный фотоальбом',
          text: 'Соберите известные фотографии и вставьте в них лица своих друзей. Будет весело посмотреть на них на Луне, на Ялтинской конференции или на картине Ван Гога — можно собрать целый альбом.'
        },
        how: {
          text: 'Главное — ракурс. Смело экспериментируйте с фотографиями и нейросетями (вам пригодится, например, TurboText или Artguru AI). Если вы претендуете на звание «Король приколов» — вставляйте лица в видеомемы, отрывки сериалов и фильмов. Такое можно провернуть с помощью Faceswap и подобных нейросетей.'
        }
      }
    },
    inspiring: {
      min: {
        what: {
          title: 'Плейлист о вашей дружбе',
          text: 'Соберите в одном месте ностальгические треки: песни, которые напоминают о первой совместной поездке, которые вы знаете наизусть или под которые вас всегда тянет выйти на танцпол.'
        },
        how: {
          text: 'Собрать плейлист можно почти в любом музыкальном сервисе. Например, в Яндекс Музыке нужно зайти в «Коллекцию» и нажать на плюс: дальше останется только придумать название с описанием и подобрать треки. '
        }
      },
      max: {
        what: {
          title: 'Вдохновляющий to-do лист',
          text: 'Соберите для друзей список приключений на следующий год: новые хобби, мероприятия, курсы. Если они давно хотели решиться на карьерные изменения, добавьте промокод на курсы Яндекс Практикума — чтобы новые навыки или целую профессию можно было освоить со скидкой.'
        },
        how: {
          text: 'Если идей не хватает, обратитесь к YandexGPT. Расскажите ей, чем увлекается друг, что ему нравится и что хочется попробовать. Нейросеть предложит креативные идеи, которые можно адаптировать под себя.'
        }
      }
    },
    useful: {
      min: {
        what: {
          title: 'Совместный виш-лист',
          text: 'Создайте телеграм-канал для друзей, куда каждый может писать о том, что его бы порадовало: например, на день рождения хочется приставку, а сегодня — пиццу, чтобы скрасить грустный вечер. Увидите такой пост — заказывайте такси в Яндекс Go и отправляйтесь по нужному адресу (не забыв заехать в пиццерию).'
        },
        how: {
          text: 'Создайте закрытый телеграм-канал, пригласите всех друзей, назначьте их администраторами и откройте комментарии. Такой виш-лист станет не только кладезью мыслей, как порадовать близких на Новый год и другие праздники, но и местом смешных обсуждений и генерации новых идей.'
        }
      },
      max: {
        what: {
          title: 'Календарь встреч',
          text: 'Взрослая жизнь — это когда с друзьями о встрече нужно договариваться минимум за месяц, чтобы все нашли силы и время. Предлагаем пойти дальше и сгенерировать календарь поводов на целый год вперёд (а ещё наказания за неявку).'
        },
        how: {
          text: 'Вспомните все памятные даты: от годовщины дружбы до самой запоминающейся вечеринки. Занесите их календарь и поделитесь доступом. Воспользуйтесь YandexGPT и попросите покреативить с наказаниями, чтобы друзья 100 раз подумали, прежде чем придумывать новые отмазки.'
        }
      }
    }
  }
};

const TEXTS = {
  colleagues: "Сканируем офисные будни",
  partner: "Запущена программа ROMANTIKA",
  family: "Уровень тепла настроен на 100%",
  friends: "Анализируем весёлые воспоминания"
};

const SHADOW_COLORS = {
  "rgba(71, 152, 255, 0.7)": "rgb(71, 152, 255)",
  "rgba(168, 255, 130, 0.7)": "rgb(168, 255, 130)",
  "rgba(151, 97, 219, 0.7)": "rgb(151, 97, 219)",
  "rgba(13, 253, 242, 0.7)": "rgb(13, 253, 242)"
}

document.addEventListener('DOMContentLoaded', function() {

  // Находим элементы
  const recipientInputs = document.querySelectorAll('input[name="recipient"]');
  const textEl = document.getElementById('text');
  const vibeInputs = document.querySelectorAll('input[name="vibe"]');
  const colorInputs = document.querySelectorAll('input[name="color"]');
  const difficultyInput = document.getElementById('difficulty-range');
  const slider = document.getElementById("difficulty-range");
  const sliderMove = document.querySelector(".slider-move");
  const sliderShadow = document.querySelector(".slider-shadow");
  const sliderShadowStops = sliderShadow.querySelectorAll("stop");
  const minMax = document.querySelector('.minmax-value');
  const btnSubmit = document.querySelector('.btn-submit');
  const videoBlock = document.querySelector('.video');
  const ideaBackground = document.querySelector('.idea-background');
  const ideaWhat = document.querySelector('.idea-what');
  const ideaHow = document.querySelector('.idea-how');
  const btnHow = document.querySelector('.btn-how');
  const btnBack = document.querySelector('.btn-back');
  const ideaTitle = document.querySelector('.idea-title');
  const ideaWhatText = document.querySelector('.idea-what-text');
  const ideaHowText = document.querySelector('.idea-how-text');
  const speed = 40;

  if (recipientInputs.length === 0 ||
      vibeInputs.length === 0 ||
      colorInputs.length === 0 ||
      !difficultyInput ||
      !btnSubmit ||
      !videoBlock ||
      !ideaBackground) {
    return;
  }

  // Функция для анимации печати текста
  function typeText(text,) {
    textEl.innerHTML = '';
    let i = 0;

    function print() {
      if (i <= text.length) {
        textEl.innerHTML = text.slice(0, i);
        i++;
        setTimeout(print, speed);
      }
    }

    print();
  }

  // Устанавливаем рандомные настройки при загрузке страницы
  const randomRecipientIndex = Math.floor(Math.random() * recipientInputs.length);
  const randomVibeIndex = Math.floor(Math.random() * vibeInputs.length);
  const randomColorIndex = Math.floor(Math.random() * colorInputs.length);
  const randomRecipientInput = recipientInputs[randomRecipientIndex];
  const randomVibeInput = vibeInputs[randomVibeIndex];
  const randomColorInput = colorInputs[randomColorIndex];
  randomRecipientInput.checked = true;
  randomVibeInput.checked = true;
  randomColorInput.checked = true;
  typeText(TEXTS[randomRecipientInput.value]);
  sliderShadowStops.forEach(stop => {
    stop.setAttribute("stop-color", randomColorInput.value);
  });

  // Двигаем картинки вместе со слайдером
  function updateSliderMove() {
    const min = Number(slider.min);
    const max = Number(slider.max);
    const value = Number(slider.value);

    const trackWidth = slider.offsetWidth;
    const percent = (value - min) / (max - min);
    const thumbWidth = slider.offsetHeight;
    const position = percent * (trackWidth - thumbWidth) + thumbWidth / 2;

    sliderMove.style.left = position + "px";
  }

  slider.addEventListener("input", updateSliderMove);
  window.addEventListener("resize", updateSliderMove);

  updateSliderMove();

  // Отслеживаем изменения настроек
  function enableSubmitOnChange() {
    btnSubmit.disabled = false;
    btnSubmit.innerHTML = 'Получить идею';
  }

  recipientInputs.forEach(input => {
    input.addEventListener('change', function() {
      enableSubmitOnChange();
      const selectedText = document.querySelector('input[name="recipient"]:checked')?.value;
      typeText(TEXTS[selectedText]);
    });
  });

  vibeInputs.forEach(input => {
    input.addEventListener('change', function() {
      enableSubmitOnChange();
    });
  });

  colorInputs.forEach(input => {
    input.addEventListener('change', function() {
      enableSubmitOnChange();
      const selectedColor = document.querySelector('input[name="color"]:checked')?.value;
      sliderShadowStops.forEach(stop => {
        stop.setAttribute("stop-color", selectedColor);
      });
    });
  });

  difficultyInput.addEventListener('change', function() {
    enableSubmitOnChange();
    minMax.innerHTML = difficultyInput.value <= 50? 'min' : 'max';
  });

  // Прячем/показываем карточки идей
  function showHowHideWhat() {
    if (ideaWhat) ideaWhat.style.display = 'none';
    if (ideaHow) ideaHow.style.display = 'flex';
  }

  function showWhatHideHow() {
    if (ideaWhat) ideaWhat.style.display = 'flex';
    if (ideaHow) ideaHow.style.display = 'none';
  }

  btnHow.addEventListener('click', function() {
    showHowHideWhat();
  });

  btnBack.addEventListener('click', function() {
    showWhatHideHow();
  });

  // Обработчик кнопки Получить идею
  btnSubmit.addEventListener('click', function(event) {

    // Предотвращаем всплытие события
    event.preventDefault();

    // Делаем кнопку неактивной до изменения настроек
    btnSubmit.disabled = true;
    btnSubmit.innerHTML = 'Поменяйте что-то в фильтрах';

    // Показываем карточку идеи
    showWhatHideHow();

    // Вставляем текст согласно настройкам
    const selectedRecipient = document.querySelector('input[name="recipient"]:checked')?.value;
    const selectedVibe = document.querySelector('input[name="vibe"]:checked')?.value;
    const selectedDifficulty = difficultyInput.value <= 50? 'min' : 'max';
    ideaTitle.innerHTML = IDEAS[selectedRecipient][selectedVibe][selectedDifficulty].what.title;
    ideaWhatText.innerHTML = IDEAS[selectedRecipient][selectedVibe][selectedDifficulty].what.text;
    ideaHowText.innerHTML = IDEAS[selectedRecipient][selectedVibe][selectedDifficulty].how.text;

    // Показываем цвет согласно настройкам
    const selectedColor = document.querySelector('input[name="color"]:checked')?.value;
    if (selectedColor) {
      ideaBackground.style.backgroundColor = selectedColor;
    }

    // Прячем видео
    videoBlock.style.display = 'none';

  });

});


